# **Pandas 04**

# **#13 Konversi nilai numerik ke dalam kategori pada Data Frame** 
Source : [Indonesia Belajar](https://youtu.be/XPnqfKc0BrQ)

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.1
1.24.2

# Persiapan Data Frame

In [2]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    15
1    83
2    56
3    87
4    10
5    43
6    11
7    77
8    90
9    73

# Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

- Membuat kolom baru bernama 'kelompok_usia'.
- Fungsi cut() akan memisahkan data dan mengelompokannya sesuai dengan kelompoknya.
- df adalah kolom usia yang ingin kita cut;
- Rentang 0-18 akan memiliki label anak;
- Rentang 18-65 akan memiliki label dewasa;
- Rentang 65-99 akan memiliki label manula.

In [3]:
# Menggunakan metode cut dari pandas untuk membuat kolom 'kelompok_usia' berdasarkan kolom 'usia' dalam data frame
# Parameter bins digunakan untuk menentukan batas kelompok usia dalam bentuk list
# Parameter labels digunakan untuk memberikan label pada masing-masing kelompok usia
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])

# Menampilkan data frame dengan tambahan kolom 'kelompok_usia'
df

   usia kelompok_usia
0    15          anak
1    83        manula
2    56        dewasa
3    87        manula
4    10          anak
5    43        dewasa
6    11          anak
7    77        manula
8    90        manula
9    73        manula

# **#14 Menggabungkan dua Pandas Data Frame**
Source : [Indonesia Belajar](https://youtu.be/kNaEWgZksZk)

# Import Modules

In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.1
1.24.2

# Persiapan Data Frame

In [5]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  13  19   8  19   6
1  11   3  17   4   9
2   3  15   3  18  17
3   5  18   1  12  13
4   3   4  18   5  10

- Membagi dataframe yang telah dibuat menjadi 2 bagian, yang kemudian digabungkan kembali

In [6]:
# Membuat salinan mendalam (deep copy) dari data frame df dan menyimpannya dalam variabel df1
df1 = df.copy(deep=True)

# Menggunakan metode drop untuk menghapus baris dengan indeks 1 dan 4 dari data frame df1
df1 = df1.drop([1, 4])

# Menampilkan data frame df1 setelah penghapusan baris dengan indeks 1 dan 4
df1

    A   B  C   D   E
0  13  19  8  19   6
2   3  15  3  18  17
3   5  18  1  12  13

In [7]:
# Membuat salinan mendalam (deep copy) dari data frame df dan menyimpannya dalam variabel df2
df2 = df.copy(deep=True)

# Menggunakan metode drop untuk menghapus baris dengan indeks 0 dan 3 dari data frame df2
df2 = df2.drop([0, 3])

# Menampilkan data frame df2 setelah penghapusan baris dengan indeks 0 dan 3
df2

    A   B   C   D   E
1  11   3  17   4   9
2   3  15   3  18  17
4   3   4  18   5  10

# Menggabungkan Dua Data Frame
- Kita akan menggunakan 2 cara dari fungsi merge() ini, yaitu secara inner dan outer.
- Parameter ke-3 dapat diatur dengan how menjadi inner, Karena itu akan menghasilkan irisan dari dataframe yang kita pilih.
- Namun, jika kita mengatur parameter tersebut menjadi outer, itu akan menghasilkan gabungan dari data frame yang kita pilih.
- Perlu diingat indeks pada gabungan data frame akan dibuat ulang.

In [8]:
# Menggunakan metode merge dari pandas untuk menggabungkan dua data frame (df1 dan df2) berdasarkan indeks secara inner join
# Parameter how='inner' digunakan untuk menentukan jenis join yang dilakukan, dalam hal ini inner join
df_inner = pd.merge(df1, df2, how='inner')

# Menampilkan hasil penggabungan data frame df1 dan df2 dengan inner join
df_inner

   A   B  C   D   E
0  3  15  3  18  17

In [9]:
# Menggunakan metode merge dari pandas untuk menggabungkan dua data frame (df1 dan df2) berdasarkan indeks secara outer join
# Parameter how='outer' digunakan untuk menentukan jenis join yang dilakukan, dalam hal ini outer join
df_outer = pd.merge(df1, df2, how='outer')

# Menampilkan hasil penggabungan data frame df1 dan df2 dengan outer join
df_outer

    A   B   C   D   E
0  13  19   8  19   6
1   3  15   3  18  17
2   5  18   1  12  13
3  11   3  17   4   9
4   3   4  18   5  10

# **#15 Memecah Nilai String dari Suatu Kolom ke Dalam Beberapa Kolom Baru**
Source : [Indonesia Belajar](https://youtu.be/oaBKGKTERfU)

# Import Modules

In [10]:
import pandas as pd

print(pd.__version__)

2.1.1

# Persiapan Data Frame
- Membuat dataframe dengan 2 buah keys yang masing-masing keys nya berisi 3 buah values

In [11]:
# Membuat data frame menggunakan dictionary sebagai sumber datanya
# Data frame memiliki dua kolom, 'nama' dan 'tempat_kelahiran', yang berisi informasi tentang nama dan tempat kelahiran seseorang
data = {'nama':['Rafi Ahmad', 'Chris John', 'Ade Rai'], 
        'tempat_kelahiran':['Bandung, Jawa Barat', 'Banjarnegara, Jawa Tengah', 'Jakarta, DKI Jakarta']}

df = pd.DataFrame(data)

# Menampilkan data frame yang telah dibuat
df

         nama           tempat_kelahiran
0  Rafi Ahmad        Bandung, Jawa Barat
1  Chris John  Banjarnegara, Jawa Tengah
2     Ade Rai       Jakarta, DKI Jakarta

# Memecah Nama Depan dan Nama Belakang
- Buatlah 2 buah kolom baru.
- Memisahkan kolom nama dengan fungsi split().
- Parameter kedua (tambahan) fungsi split() di beri nilai true agar output dapat berupa multiple columns.

In [12]:
# Menggunakan metode str.split untuk membagi kolom 'nama' menjadi dua kolom, 'nama_depan' dan 'nama_belakang'
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)

# Menampilkan data frame dengan tambahan dua kolom baru, 'nama_depan' dan 'nama_belakang'
df

         nama           tempat_kelahiran nama_depan nama_belakang
0  Rafi Ahmad        Bandung, Jawa Barat       Rafi         Ahmad
1  Chris John  Banjarnegara, Jawa Tengah      Chris          John
2     Ade Rai       Jakarta, DKI Jakarta        Ade           Rai

# Memecah Nama Kota dan Propinsi
- Buatlah 2 buah kolom baru.
- Memisahkan kolom nama dengan fungsi split().
- Untuk memisahkan, pastikan gunakan koma (,) yang diatur pada paremeter pertama fungsi split.
- Parameter kedua (tambahan) fungsi split() di beri nilai true agar output dapat berupa multiple columns.

In [13]:
# Menggunakan metode str.split untuk membagi kolom 'tempat_kelahiran' menjadi dua kolom, 'kota' dan 'propinsi'
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)

# Menampilkan data frame dengan tambahan dua kolom baru, 'kota' dan 'propinsi'
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Rafi Ahmad,"Bandung, Jawa Barat",Rafi,Ahmad,Bandung,Jawa Barat
1,Chris John,"Banjarnegara, Jawa Tengah",Chris,John,Banjarnegara,Jawa Tengah
2,Ade Rai,"Jakarta, DKI Jakarta",Ade,Rai,Jakarta,DKI Jakarta

# **#16 Menata Ulang Data Frame dengan Mutiple Indexes Menggunakan unstack()**
Source : [Indonesia Belajar](https://youtu.be/Ec1zjSJYfiY)

# Import Modules

In [14]:
import pandas as pd

print(pd.__version__)

2.1.1

# Persiapan Data Frame
Dataframe kali ini menggunakan titanic data set.

In [15]:
# Menggunakan metode read_csv dari pandas untuk membaca file CSV (Comma-Separated Values) 
# dan menyimpannya dalam data frame df
df = pd.read_csv('./data/titanicfull.csv')

# Menampilkan lima data awal dari data frame
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# Data Frame dengan Multiple Indexes dari Hasil Groupping

- Data dikelompokkan kedalam beberapa kelompok berdasarkan sex dan pclass.
- Data yang diamati sekarang adalah survived dimana 0 untuk tidak selamat dan 1 untuk selamat.
- Karena survived sudah dikelompokkan kedalam sex dan pclass, kita tidak dapat mengakses nilai tersebut kembali.
- Fungsi to_frame() hanya untuk mempercantik ouput tampilan.

In [16]:
# Menggunakan metode groupby dari pandas untuk mengelompokkan data berdasarkan kolom 'sex' dan 'pclass'
# Kemudian, menggunakan kolom 'survived' sebagai target untuk menghitung rata-rata
# Hasilnya, ditampilkan dalam bentuk data frame
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

# Menata Ulang Data Frame dengan Mutiple Index

- Untuk melakukan reshapping dataframe yang memiliki multiple index, kita hanya perlu menggunakan fungsi unstack().

In [17]:
# Menggunakan metode groupby dari pandas untuk mengelompokkan data berdasarkan kolom 'sex' dan 'pclass'
# Kemudian, menggunakan kolom 'survived' sebagai target untuk menghitung rata-rata
# Metode unstack digunakan untuk mengubah hasil groupby menjadi bentuk yang lebih lebar (tidak berhimpit)
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130